[
  {
    "question_id": "125",
    "question": "Which food on the plate grows in the ground? Choices: chicken, carrot, dried cranberry, bread",
    "predicted_answer": "Carrot",
    "prediction_is_correct": 1,
    "generated_rationale": "The food on the plate that grows in the ground is the carrot. Carrots are root vegetables that grow underground, while chicken, bread, and dried cranberry do not grow in the ground.",
    "visual_fidelity": 1.0,
    "contrastiveness": 0.9999943527681177
  },
  {
    "question_id": "206",
    "question": "Why is his arm up in the air? Choices: signal, balance, wave, reach",
    "predicted_answer": "Reach",
    "prediction_is_correct": 1,
    "generated_rationale": "The man's arm is up in the air because he is reaching to hit the tennis ball with his racket. This is a common action during a tennis match, as players need to extend their arms to make contact with the ball and return it to the opponent's side of the court. The other choices, signal, balance, and wave, do not accurately describe the situation depicted in the image.",
    "visual_fidelity": 1.0,
    "contrastiveness": 0.9844872602375804
  },
  {
    "question_id": "497",
    "question": "Why would one sit here? Choices: work, relax, paint, eat",
    "predicted_answer": "Relax",
    "prediction_is_correct": 1,
    "generated_rationale": "The most likely reason for someone to sit here is to relax. In the image, there is a beach chair and an umbrella set up on a sandy beach near the water. The umbrella provides shade and protection from the sun, while the beach chair offers a comfortable place to sit and enjoy the surroundings. The beach setting is typically associated with relaxation and leisure activities, such as sunbathing, swimming, or simply watching the waves roll in. Therefore, it is reasonable to assume that someone would choose to sit here to unwind and take a break from their daily routine.",
    "visual_fidelity": 1.0,
    "contrastiveness": 0.9999317794932258
  },
  {
    "question_id": "437",
    "question": "Why do these boats are painted in different color? Choices: trend, security, custom, visibility",
    "predicted_answer": "Visibility",
    "prediction_is_correct": 1,
    "generated_rationale": "The boats are painted in different colors to make them more visible and easily identifiable in the water. This is particularly important for safety reasons, as it helps prevent collisions between boats or with other objects in the water. The bright colors also make it easier for boat owners to locate their boats when they return to the marina or docking area.",
    "visual_fidelity": 1.0,
    "contrastiveness": 0.9483771989935788
  },
  {
    "question_id": "265",
    "question": "Why is the man jumping on the red pipe? Choices: to dodge, to sit, to grind, to roll",
    "predicted_answer": "To grind",
    "prediction_is_correct": 1,
    "generated_rationale": "The man is jumping on the red pipe to grind. Grinding is a snowboarding trick where the rider slides along a surface, such as a rail or a pipe, using the snowboard's edge. In this image, the man is performing a grinding trick on the red pipe, showcasing his skill and control over the snowboard.",
    "visual_fidelity": 0.75,
    "contrastiveness": 0.7414496884309518
  },
  {
    "question_id": "43",
    "question": "Which food item is the knife for? Choices: bread, fruit, vegetables, meat",
    "predicted_answer": "Meat",
    "prediction_is_correct": 1,
    "generated_rationale": "The knife is for cutting meat. In the image, there is a plate with meat on it, and a knife is placed next to it. The presence of the knife suggests that it is being used to cut or prepare the meat on the plate. The knife is a common utensil used in the kitchen for cutting various food items, including vegetables and fruits, but in this context, it is most likely being used for cutting meat.",
    "visual_fidelity": 1.0,
    "contrastiveness": 0.00034038655996857604
  },
  {
    "question_id": "205",
    "question": "What is the man with the black glove about to do? Choices: push ups, sit ups, throw ball, dive",
    "predicted_answer": "Throw ball",
    "prediction_is_correct": 1,
    "generated_rationale": "The man with the black glove is a baseball pitcher, and he is about to throw the ball. This is evident from the fact that he is standing on the pitcher's mound, which is the designated area for pitchers to throw the ball during a baseball game. The pitcher's role is to throw the ball towards the batter in an attempt to get the batter out by striking them out or inducing a weak hit that can be easily fielded by the defensive team. Therefore, the man with the black glove is about to throw the ball as part of his role as a baseball pitcher.",
    "visual_fidelity": 1.0,
    "contrastiveness": 0.9999996279064839
  },
  {
    "question_id": "69",
    "question": "What is the skateboard balanced on? Choices: post, air, chain, ground",
    "predicted_answer": "Post",
    "prediction_is_correct": 0,
    "generated_rationale": "The skateboard is balanced on a post. In the image, the skateboarder is performing a trick where the skateboard is balanced on a metal pole. This requires skill and balance to maintain the position of the skateboard while the skateboarder is in the air. The skateboard is not balanced on the ground, air, or a chain.",
    "visual_fidelity": 0.5,
    "contrastiveness": 0.9980905142624331
  },
  {
    "question_id": "38",
    "question": "What kind of terrain is it? Choices: beach, desert, savanna, valley",
    "predicted_answer": "Savanna",
    "prediction_is_correct": 1,
    "generated_rationale": "The terrain in the image is a savanna, which is characterized by a mix of grasses, shrubs, and scattered trees. This type of environment is typically found in Africa and is home to a variety of wildlife, including elephants. The presence of elephants in the image supports the notion that the terrain is a savanna, as these animals are commonly found in such habitats.",
    "visual_fidelity": 1.0,
    "contrastiveness": 0.9999086758260315
  },
  {
    "question_id": "297",
    "question": "What type of shot is the woman about to hit? Choices: forehand, serve, backhand, slice",
    "predicted_answer": "Forehand",
    "prediction_is_correct": 1,
    "generated_rationale": "The woman in the image is about to hit a forehand shot. This can be deduced from the fact that she is holding a tennis racket and is positioned on a tennis court. The forehand shot is the most common and basic shot in tennis, where the player swings the racket across their body with the palm of their hand facing the incoming ball. The other shots, such as the serve, backhand, and slice, involve different techniques and racket positions, making them less likely to be the shot the woman is about to hit.",
    "visual_fidelity": 1.0,
    "contrastiveness": 0.9999285271016091
  }
]